use kontakty_studentov;

INSERT INTO fakultet (fakultet)
VALUES ('Строительный'), ('Информатика'), ('Инженерия'), ('Медицинский');

INSERT INTO kafedra (kafedra, id_fakultet)
VALUES ('Экономический','1'),('Юридический','2'),('Исторический','3'),('Филологический','4');

INSERT INTO gruppa (gruppa, gruppa_sokr)
VALUES ('AIN-2-21', '1'),('WIN-2-21', '2');

INSERT INTO natsionalnost(natsionalnost)
VALUES ('кыргыз'),('русский'),('узбек'),('казах');

INSERT INTO oblast(oblast)
VALUES ('Чуй'),('Ош'),('Акмолинская'),('Московская');

INSERT INTO rayon(rayon, id_oblast)
VALUES ('Бишкек','1'),('Ош','2'),('Астана','3'),('Москва','4');


INSERT INTO nas_punkt(nas_punkt, id_rayon)
VALUES ('Бишкек','1'),('Ош','2'),('Астана','3'),('Москва','4');

INSERT INTO pol(pol)
VALUES ('мужской'),('женский');


INSERT INTO student(fam,imya, otch, passport, password, reg_date, comments, id_gruppa, id_nas_punkt, id_natsionalnost, id_pol)
VALUES 
('Умаров','Мухаммад', 'Умарович','ID24235','12345678', '2003-10-20','ыывыва','1','1','1', '1'),
('Рамазанов','Али','Рамазанович','ID43534','12345678', '2002-09-10','ываффпы','2','2','2','1'),
('Алиханов','Нурик','Алиханович','ID54366','12345678', '2004-11-11','ыапвап','1','3','3','1'),
('Алинуров','Эрик','Алинурович','ID324662','12345678', '2000-03-22','ыввпфвп','2','4','4','1'),
('Билалов','Аскат','Билалович','ID3246','12345678', '2004-05-08','вафпфвп','1','1','1','1'),
('Нурисламов','Папич','Нурисламович','ID4869','12345678', '2002-07-12','апыапыф','2','2','2','1'),
('Вагнер','Чвк','Реданович','ID67857','12345678', '2003-02-04','выпфыапыв','1','3','3','1'),
('Эмирова','Фея','Эмировна','ID79543','12345678', '2000-12-20','выпывымвымвы','2','4','4','2'),
('Атиллов','Султан','Атиллович','ID78658','12345678','2001-06-16','апываумфвам','1','2','1','1'),
('Стамов','Алтай','Медетович','ID2634','12345678', '2003-03-15','Я устал','2','1','2','1');


INSERT INTO tip_kont(tip_kont)
VALUES ('email'), ('telefon');


INSERT INTO kontakty(kontakty, id_tip_kont, id_student)
VALUES 
('a@gmail.com', '1', '11'),
('+(996) 777 777 222', '2', '11'),
('aa@gmail.com', '1', '11'),
('+(996) 777 555 222', '2', '12'),
('a@gmail.com', '1', '12'),
('+(996) 777 666 222', '2', '12'),
('a@gmail.com', '1', '3'),
('+(996) 777 444 222', '2', '3'),
('aa@gmail.com', '1', '3'),
('+(996) 777 333 222', '2', '4'),
('a@gmail.com', '1', '4'),
('+(996) 777 222 222', '2', '4'),
('a@gmail.com', '1', '5'),
('+(996) 777 111 222', '2', '5'),
('aa@gmail.com', '1', '5'),
('+(996) 777 888 222', '2', '6'),
('a@gmail.com', '1', '6'),
('+(996) 777 999 222', '2', '6'),
('a@gmail.com', '1', '7'),
('+(996) 777 112 222', '2', '7'),
('a@gmail.com', '1', '8'),
('+(996) 777 223 222', '2', '8'),
('aa@gmail.com', '1', '8'),
('+(996) 777 334 222', '2', '9'),
('aa@gmail.com', '1', '9'),
('+(996) 777 556 222', '2', '9'),
('a@gmail.com', '1', '10'),
('+(996) 777 778 222', '2', '10'),
('aa@gmail.com', '1', '10');

INSERT INTO sostav(sostav)
VALUES ('pehota'), ('morskiye'), ('vozdushnoe');

INSERT INTO zvanie(zvanie, id_sostav)
VALUES('kapitan','1'),( 'serjant','2'), ('kapral','3'),('mayor','1');

INSERT INTO voinsk_slujba(data_nach, data_okon, nomer_prik, comments, id_student, id_zvanie)
VALUES ('2022-09-10','2023-09-10', '123', 'dfdggds', '11','1'),
('2020-08-10','2023-11-14', '123', 'dfdggds', '12','2'),
('2019-10-10','2023-12-10', '123', 'dfdggds', '3','3'),
('2023-11-10','2024-02-02', '123', 'dfdggds', '6','4'),
('2024-04-02','2023-03-05', '123', 'dfdggds', '8','1'),
('2025-02-10','2023-07-10', '123', 'dfdggds', '4','2');


INSERT INTO tip_pov_kval(tip_pov_kval)
VALUES ('не знаю'),('знаю'),('не знаю');


INSERT INTO grajdanstvo(grajdanstvo)
VALUES ('кыргызское'),('российское'),('казахское');


INSERT INTO pov_kval(data_pov, nomer_doc, comments, id_student, id_tip_pov_kval)
VALUES ('2022-09-10','1', 'dcsdds','11','1'),
('2022-09-10','2','dcsdds','12','1'),
('2022-09-10','3','dcsdds','13','2'),
('2022-09-10','4','dcsdds','4','1'),
('2022-09-10','5','dcsdds','5','1'),
('2022-09-10','6','dcsdds','6','2'),
('2022-09-10','7','dcsdds','7','2'),
('2022-09-10','8','dcsdds','8','1'),
('2022-09-10','9','dcsdds','9','1'),
('2022-09-10','10','dcsdds','10','2');

